{
    "anchovy": {
        "name": "Anchovy",
        "scientific": "Engraulis encrasicolus",
        "type": "fresh",
        "color": "#C5C7DD",
        "emoji_id": "1205847963021090877",
        "rarity": 1,
        "price": 5,
        "min_size": 2,
        "max_size": 40,
        "description": "Blather: There are more than 140 species of anchovy, but they do all have some things in common. They are all small and feed by simply swimming with their mouths open to filter food particles from the sea. In my sleepier moments, I sometimes wish I could do that..."
    },
    "tadpole": {
        "name": "Tadpole",
        "scientific": "Rana temporaria",
        "type": "fresh",
        "color": "#595757",
        "emoji_id": "1205851396994498571",
        "rarity": 1,
        "price": 3,
        "min_size": 3,
        "max_size": 11,
        "description": "Blather: Tadpoles are nothing more than baby frogs and generally inhabit ponds and streams. Their round heads and quirky style of movement give them a different kind of cuteness from adult frogs. They become more frog-like when they eventually grow legs and start to lose their tails. Unlike fish, though, their skin is very delicate because they do not have scales, so handle carefully."
    },
    "sea_bass": {
        "name": "Sea Bass",
        "scientific": "Dicentrarchus labrax",
        "type": "salt",
        "color": "#939446",
        "emoji_id": "1205852458941943829",
        "rarity": 1,
        "price": 10,
        "min_size": 2,
        "max_size": 200,
        "description": "Blather: Sea bass are famous for their delicious white meat as well as their large size. If they ingest something inedible, they open up their mouths and gills and violently shake their heads. This generally manages to expel the foreign material, though it has the added effect of looking rather odd. Much like their freshwater cousins, sea bass have a strong pull, making them a great challenge for anglers."
    },
    "guppy": {
        "name": "Guppy",
        "scientific": "Poecilia reticulata",
        "type": "fresh",
        "color": "#5E718E",
        "emoji_id": "1205853825513029675",
        "rarity": 1,
        "price": 7,
        "min_size": 1.5,
        "max_size": 6,
        "description": "Blather: Guppies are tropical fish that are related to killifish and live in warm rivers. They are popular fish that have been bred to have beautiful flowing tail fins. Mother guppies give birth to their babies after the eggs hatch in their bellies. They give birth at a rate that's nearly constant, so their population tends to grow rather quickly."
    },
    "dace": {
        "name": "Dace",
        "scientific": "Leuciscus leuciscus",
        "type": "fresh",
        "color": "#323232",
        "emoji_id": "1205854655402483714",
        "rarity": 1,
        "price": 10,
        "min_size": 25,
        "max_size": 30,
        "description": "Blather: Dace can live in cloudier, murkier water than most but are easy to see as their numbers are so plentiful. They are related to carp, and some species of dace live in the ocean as well as rivers and streams. During mating season, the bellies of the males develop an orange stripe to indicate their intent to mate."
    },
    "clam": {
        "name": "Clam",
        "scientific": "Bivalvia",
        "type": "salt",
        "color": "#D6A851",
        "emoji_id": "1205856816169488444",
        "rarity": 1,
        "price": 9,
        "min_size": 3,
        "max_size": 10,
        "description": "Blather: Bivalves shaped like chestnuts, they live in shallow waters and hide in sand when predators approach. They secrete a viscous liquid that gets pulled along by the current and enables long-distance travel. They are popular both roasted in the shell and cooked in a variety of soups and chowders."
    },
    "flounder": {
        "name": "Flounder",
        "scientific": "Paralichthys dentatus",
        "type": "salt",
        "color": "#7F8E44",
        "emoji_id": "1205856191477981234",
        "rarity": 2,
        "price": 65,
        "min_size": 20,
        "max_size": 60,
        "description": "Blather: Flounders are rather flexible whitefish that have both eyes on the left side of their body. They can reach three feet in length and are commonly mistaken for dabs, a close relative. When young, they have an eye on each side, but as they age, their right eye migrates to their left side. These carnivorous fish can change color to camouflage themselves on the seabed as they wait for prey."
    },
    "crab": {
        "name": "Crab",
        "scientific": "Brachyura",
        "type": "salt",
        "color": "#807B7A",
        "emoji_id": "1205857671350190092",
        "rarity": 2,
        "price": 50,
        "min_size": 8,
        "max_size": 30,
        "description": "Crabs are an infraorder of crustaceans encompassing over 7000 species found all throughout the world. Most are aquatic, with species of this type being found in both freshwater and saltwater environments (including all five oceans), but some variants predominantly reside on land. True crabs are primarily distinguished by the near total absence of a visible tail, resulting in a distinctly oblong shape. Crabs are omnivorous, and depending on their environment and current circumstances may primarily eat plant matter, prey on living animals, or scavenge corpses."
    },
    "tuna": {
        "name": "Tuna",
        "scientific": "Thunnus",
        "type": "salt",
        "color": "#465456",
        "emoji_id": "1205859168452349962",
        "rarity": 3,
        "price": 200,
        "min_size": 50,
        "max_size": 450,
        "description": "Blather: Tuna can reach almost 10 feet (3 meters) in length and weigh over 800 pounds (360 kg), which is huge in the fish world. Combining this great size with their good flavor makes them literally the biggest catch for most anglers. Tuna can't breathe when they aren't moving, so their entire lives revolve around constantly swimming. To sleep, they merely slow down. This ability to swim while sleeping is a huge advantage. They're also rather fast, capable of beating both sets of fins so hard they reach speeds of 50 mph (80 km/h)."
    },
    "oarfish": {
        "name": "Oarfish",
        "scientific": "Regalecus glesne",
        "type": "salt",
        "color": "#B4202A",
        "emoji_id": "1205860990403608696",
        "rarity": 4,
        "price": 1000,
        "min_size": 200,
        "max_size": 800,
        "description": "Blather: The oarfish is a long, eel-like fish that can supposedly reach up to 36 feet in length. They appear in various legends as things like messengers of the gods. It seems to me a creature like that could explain the myth of massive, ship-crushing sea serpents. It is, of course, well documented that people tend to exaggerate the size of 'the one that got away'."
    },
    "whaleshark": {
        "name": "Whaleshark",
        "scientific": "Rhincodon typus",
        "type": "salt",
        "color": "#886E6A",
        "emoji_id": "1205861679443738735",
        "rarity": 5,
        "price": 5000,
        "min_size": 1200,
        "max_size": 2000,
        "description": "The whale shark holds many records for size in the animal kingdom, most notably being by far the most massive living non-mammalian animal. Whale sharks inhabit the open waters of all tropical oceans, so they are rarely found in water below 21 °C (70 °F). Their lifespans are estimated to be between 80 and 130 years. Whale sharks have very large mouths and are filter feeders, which is a feeding mode that occurs in only two other sharks, the megamouth shark and the basking shark. They feed almost exclusively on plankton and small fishes and pose no threat to humans."
    }
}