{
    "anchovy": {
        "name": "Anchovy",
        "scientific": "Engraulis encrasicolus",
        "type": "fresh",
        "color": "#C5C7DD",
        "emoji_id": "1205847963021090877",
        "rarity": 1,
        "price": 5,
        "min_size": 2,
        "max_size": 40,
        "description": "Blather: There are more than 140 species of anchovy, but they do all have some things in common. They are all small and feed by simply swimming with their mouths open to filter food particles from the sea. In my sleepier moments, I sometimes wish I could do that..."
    },
    "tadpole": {
        "name": "Tadpole",
        "scientific": "Rana temporaria",
        "type": "fresh",
        "color": "#595757",
        "emoji_id": "1205851396994498571",
        "rarity": 1,
        "price": 1,
        "min_size": 1,
        "max_size": 11,
        "description": "Blather: Tadpoles are nothing more than baby frogs and generally inhabit ponds and streams. Their round heads and quirky style of movement give them a different kind of cuteness from adult frogs. They become more frog-like when they eventually grow legs and start to lose their tails. Unlike fish, though, their skin is very delicate because they do not have scales, so handle carefully."
    },
    "sea_bass": {
        "name": "Sea Bass",
        "scientific": "Dicentrarchus labrax",
        "type": "salt",
        "color": "#939446",
        "emoji_id": "1205852458941943829",
        "rarity": 1,
        "price": 10,
        "min_size": 2,
        "max_size": 200,
        "description": "Blather: Sea bass are famous for their delicious white meat as well as their large size. If they ingest something inedible, they open up their mouths and gills and violently shake their heads. This generally manages to expel the foreign material, though it has the added effect of looking rather odd. Much like their freshwater cousins, sea bass have a strong pull, making them a great challenge for anglers."
    },
    "guppy": {
        "name": "Guppy",
        "scientific": "Poecilia reticulata",
        "type": "fresh",
        "color": "#5E718E",
        "emoji_id": "1205853825513029675",
        "rarity": 1,
        "price": 7,
        "min_size": 1.5,
        "max_size": 6,
        "description": "Blather: Guppies are tropical fish that are related to killifish and live in warm rivers. They are popular fish that have been bred to have beautiful flowing tail fins. Mother guppies give birth to their babies after the eggs hatch in their bellies. They give birth at a rate that's nearly constant, so their population tends to grow rather quickly."
    },
    "dace": {
        "name": "Dace",
        "scientific": "Leuciscus leuciscus",
        "type": "fresh",
        "color": "#323232",
        "emoji_id": "1205854655402483714",
        "rarity": 1,
        "price": 10,
        "min_size": 25,
        "max_size": 30,
        "description": "Blather: Dace can live in cloudier, murkier water than most but are easy to see as their numbers are so plentiful. They are related to carp, and some species of dace live in the ocean as well as rivers and streams. During mating season, the bellies of the males develop an orange stripe to indicate their intent to mate."
    },
    "clam": {
        "name": "Clam",
        "scientific": "Bivalvia",
        "type": "salt",
        "color": "#D6A851",
        "emoji_id": "1205856816169488444",
        "rarity": 1,
        "price": 9,
        "min_size": 3,
        "max_size": 10,
        "description": "Blather: Bivalves shaped like chestnuts, they live in shallow waters and hide in sand when predators approach. They secrete a viscous liquid that gets pulled along by the current and enables long-distance travel. They are popular both roasted in the shell and cooked in a variety of soups and chowders."
    },
    "black_bass": {
        "name": "Black Bass",
        "scientific": "Micropterus",
        "type": "fresh",
        "color": "#8FD032",
        "emoji_id": "1206278827605753926",
        "rarity": 1,
        "price": 12,
        "min_size": 30,
        "max_size": 60,
        "description": "Blather: They get their name from their somewhat blackish bodies, though they have a green tint. They usually hide in weeds and wait until other fish approach before forcefully striking. Many people use lures to catch black bass because they are such strong fish. Black bass have a fierce image, as the males will scare off other fish to protect the fry in the nest. They are related to sea bass, so they make for a tasty dinner, though their skin has a very strong odor."
    },
    "sardine": {
        "name": "Sardine",
        "scientific": "Sardina pilchardus",
        "type": "salt",
        "color": "#B8CCD8",
        "emoji_id": "1206279780115283999",
        "rarity": 1,
        "price": 4,
        "min_size": 1,
        "max_size": 3,
        "description": "In the Mediterranean, the sardine moves offshore in the autumn, preferring the deeper cooler waters and constant salinity out at sea to the variable temperatures and salinities of inshore waters. Spawning starts to take place in winter, and in early spring, juveniles, larvae and some adults move towards the coast, while other adults migrate inshore later in the year."
    },
    "seaweed": {
        "name": "Seaweed",
        "scientific": "Chlorophyta",
        "type": "salt",
        "color": "#586334",
        "emoji_id": "1206280772231757874",
        "rarity": 1,
        "price": 2,
        "min_size": 10,
        "max_size": 1000,
        "description": "Blather: Seaweed can be over three feet long. When its spores attach to rocks, they take root and grow. Seaweed is naturally brown, but turns to the dark-green color we associate it with when cooked. It tends to spoil easily when picked, so various preservation methods have been developed as a necessity. Such methods of preservation are sprinkling ash and drying it out, or boiling it and adding salt."
    },
    "yellow_perch": {
        "name": "Yellow Perch",
        "scientific": "Perca flavescens",
        "type": "fresh",
        "color": "#61683A",
        "emoji_id": "1206281714750591009",
        "rarity": 1,
        "price": 8,
        "min_size": 15,
        "max_size": 30,
        "description": "Blather: These fish are relatives of sea bass, though they're preyed on by other, larger fish, such as black bass. Their defining features are their large, prickly dorsal fins and gray stripes on pale-yellow bodies. Ice fishing on frozen lakes is a very popular way to catch them in their native United States and Canada. They are often fried before being eaten, which makes them a simple but tasty meal."
    },
    "herring": {
        "name": "Herring",
        "scientific": "Clupea harengus",
        "type": "salt",
        "color": "#DCEAEE",
        "emoji_id": "1206282836596887612",
        "rarity": 1,
        "price": 6,
        "min_size": 20,
        "max_size": 30,
        "description": "Blather: Ah, the herring, a small yet significant fish that glistens like silver in the water. These fish are known for their vast schools, which create a dazzling display beneath the waves. Herrings are quite versatile, often finding their way into various dishes through salting, smoking, or pickling. Intriguingly, they communicate through a most peculiar method—flatulence! Yes, they release air from their swim bladders to send messages to one another. Beyond their culinary uses and unique communication, herrings are vital to the marine ecosystem, serving as a key food source for larger predators. A fascinating creature, indeed!"
    },
    "horse_mackerel": {
        "name": "Horse Mackerel",
        "scientific": "Trachurus trachurus",
        "type": "salt",
        "color": "#485263",
        "emoji_id": "1206283846946127965",
        "rarity": 1,
        "price": 4,
        "min_size": 15,
        "max_size": 40,
        "description": "Blather: With their appealing flavor, horse mackerel have long been a cheap and common food source. However, in certain regions, they have actually been branded as something of a luxury dish. They have tough scales on both sides of their bodies that must be removed before preparing. Though small, they are formidable carnivores. Since they go after bait, they are popular with fishers."
    },
    "frog": {
        "name": "Frog",
        "scientific": "Anura",
        "type": "fresh",
        "color": "#61A53F",
        "emoji_id": "1206285541784690688",
        "rarity": 1,
        "price": 5,
        "min_size": 3,
        "max_size": 25,
        "description": "Blather: These former tadpoles prefer to live near ponds and other damp and swampy places. They dwell on land, so they have lungs and skin as opposed to a set of gills. They like to stick close to water because they require a nice, moist lifestyle. Frogs are moist because they emit a liquid to protect their skin from dryness. If too much moisture evaporates from their thin skins, they could have trouble breathing. It's better not to handle frogs, as some species are poisonous, even to the touch!"
    },
    "sea_grapes": {
        "name": "Sea Grapes",
        "scientific": "Coccoloba uvifera",
        "type": "salt",
        "color": "#477238",
        "emoji_id": "1206296971900354660",
        "rarity": 1,
        "price": 4,
        "min_size": 50,
        "max_size": 125,
        "description": "Blather: Sea grapes are small spheres attached to slender stems on branches, similar to normal grapes. However, despite looking like and being called 'grapes', they aren't much like the land-based variety. They grow in warm oceans and are very susceptible to cold conditions, meaning refrigeration is difficult."
    },
    "minnow": {
        "name": "Minnow",
        "scientific": "Notropis atherinoides",
        "type": "fresh",
        "color": "#C6B858",
        "emoji_id": "1206298742093783081",
        "rarity": 1,
        "price": 3,
        "min_size": 2,
        "max_size": 7,
        "description": "Blather: Minnows are schooling fish, often found in large groups that move together with a grace that is quite mesmerizing. They feed on microscopic plants and animals, making them an essential part of the aquatic food web. Despite their size, minnows have a significant impact on their ecosystems, supporting species both large and small."
    },
    "brown_trout": {
        "name": "Brown Trout",
        "scientific": "Salmo trutta",
        "type": "fresh",
        "color": "#B47537",
        "emoji_id": "1206300742911008798",
        "rarity": 1,
        "price": 10,
        "min_size": 60,
        "max_size": 120,
        "description": "The brown trout is a species of fish native to Europe but has been introduced to various other regions worldwide. Notably adaptable, it thrives in a range of habitats, from cold, clear streams to larger bodies of water. This fish is recognized by its brownish coloration, speckled with darker spots that often merge into a marbled pattern, quite fascinating to observe. It's an opportunistic feeder, preying on insects, smaller fish, and other aquatic invertebrates. The brown trout is also a popular target for anglers, contributing to its widespread introduction. Its ability to adapt to various environmental conditions is quite remarkable, a testament to the resilience of nature."
    },
    "capelin": {
        "name": "Capelin",
        "scientific": "Mallotus villosus",
        "type": "fresh",
        "color": "#485263",
        "emoji_id": "1206301994864869426",
        "rarity": 1,
        "price": 5,
        "min_size": 10,
        "max_size": 25,
        "description": "The capelin is a small forage fish belonging to the smelt family, playing a crucial role in the marine ecosystem. Found primarily in the cold waters of the Arctic, North Atlantic, and North Pacific Oceans, this fish is pivotal in the diet of many larger marine animals, including whales, seals, and seabirds. The capelin is distinguished by its slender body, silvery sides, and greenish back, making it a rather unassuming yet vitally important creature of the sea. It undertakes massive migratory journeys to spawn on sandy beaches, an event that attracts a plethora of predators and is of significant ecological importance. The capelin's diet consists mainly of plankton, small crustaceans, and fish larvae, positioning it as a key link in the oceanic food chain. Despite its small size, the capelin's ecological role and contribution to the health of marine environments cannot be overstated."
    },
    "carp": {
        "name": "Carp",
        "scientific": "Cyprinus carpio",
        "type": "fresh",
        "color": "#855F39",
        "emoji_id": "1206302989162258463",
        "rarity": 1,
        "price": 10,
        "min_size": 30,
        "max_size": 80,
        "description": "Blather: These tough fish have very long life spans, capping out at ages surpassing 100 years. Their whiskers are one of their trademark features, making them relatively easy to identify. They're omnivorous and eat waterweed and bugs by sucking their food into their mouths. They also have teeth in the back of their throats that help break down shellfish for digestion."
    },
    "goldfish": {
        "name": "Goldfish",
        "scientific": "Carassius auratus",
        "type": "fresh",
        "color": "#E88A36",
        "emoji_id": "1206307258745749615",
        "rarity": 1,
        "price": 8,
        "min_size": 5,
        "max_size": 25,
        "description": "Blather: These are aquarium fish that came about by selectively breeding types of crucian carp. It took hundreds of years to get the long tail fin and beautiful color of the current breed. Even red goldfish are black when they are young and still retain other vestiges of the crucian carp. They turn red as they grow, thus gaining their much more commonly known look."
    },
    "killifish": {
        "name": "Killifish",
        "scientific": "Fundulus heteroclitus",
        "type": "fresh",
        "color": "#FFF089",
        "emoji_id": "1206307866521108521",
        "rarity": 1,
        "price": 6,
        "min_size": 2,
        "max_size": 5,
        "description": "Blather: Killifish are small, travel in schools, and are known for having eyes higher up on their faces than others. They swim in shallow areas in rivers and mostly eat bugs that float on the surface of the water. This is why they have mouths as high up their faces as their eyes, making them effective hunters. Being the same temperature as the water they inhabit, getting grabbed by warm hands can shock them."
    },
    "pale_chub": {
        "name": "Pale Chub",
        "scientific": "Zacco platypus",
        "type": "fresh",
        "color": "#2789CD",
        "emoji_id": "1206310514226110525",
        "rarity": 1,
        "price": 5,
        "min_size": 8,
        "max_size": 20,
        "description": "Blather: These fish are related to carp, with distinguishing features such as long ventral fins and protruding mouths. They have good jumping abilities, which allow them to jump up and grab bugs hanging around the water. They are known as very active fish with rather scrappy attitudes, making them tenacious survivors. During mating season, the male's stomach turns pink and its back turns blue. Females love this."
    },
    "ricefish": {
        "name": "Ricefish",
        "scientific": "Oryzias latipes",
        "type": "fresh",
        "color": "#F8E398",
        "emoji_id": "1206316508704280677",
        "rarity": 1,
        "price": 4,
        "min_size": 2,
        "max_size": 4,
        "description": "Ricefish, belonging to the genus Oryzias, are small, freshwater fish native to Asia, particularly found in Japan, where they are known as medaka. These fish are well-adapted to a variety of water conditions, including brackish environments, and are often found in rice paddies, hence their name. This habitat association has made them an integral part of wetland ecosystems, contributing to the control of mosquito populations by feeding on larvae."
    },
    "saury": {
        "name": "Saury",
        "scientific": "Cololabis saira",
        "type": "salt",
        "color": "#B8CCD8",
        "emoji_id": "1206317385242648596",
        "rarity": 1,
        "price": 4,
        "min_size": 3,
        "max_size": 5,
        "description": "The saury, also known as the Pacific saury or mackerel pike, is a small, pelagic fish widely distributed across the North Pacific Ocean. It is easily recognizable by its slender, elongated body, sharp beak-like mouth, and small finlets running along its back and belly, similar to those of tuna. Saury are highly migratory, traveling in large schools from subtropical to temperate waters, following the cold currents that provide abundant plankton and small fish on which they feed."
    },
    "salmon": {
        "name": "Salmon",
        "scientific": "Oncorhynchus",
        "type": "fresh",
        "color": "#B9451D",
        "emoji_id": "1206324631225761803",
        "rarity": 1,
        "price": 10,
        "min_size": 50,
        "max_size": 100,
        "description": "Blather: Salmon are popular migratory fish that are born in rivers, migrate to oceans, and return in four years. In Japan, flavored salmon eggs are a very popular dish called ikura, but it hasn't caught on in the US. In rare cases, salmon will only stay in the ocean for one or two years before coming back. These fish are known as 'phantom fish' since they're so hard to find in the wild. Their characteristic pink color comes from the shrimp and krill they get in their diet. If they are differently, their flesh would be white."
    },
    "pike": {
        "name": "Pike",
        "scientific": "Esox lucius",
        "type": "fresh",
        "color": "#586334",
        "emoji_id": "1206325421470261258",
        "rarity": 1,
        "price": 15,
        "min_size": 30,
        "max_size": 70,
        "description": "Blather: Pike are only found in cold water, so they cannot live in warmer parts of the world. They can grow over three feet (90 cm) long and as such are a very popular fish with anglers. Pike have a slightly protruding jaw and large mouths with sharp teeth, making them powerful predators. They use these teeth for tearing apart not only other fish but also birds and other aquatic creatures."
    },
    "mackerel": {
        "name": "Mackerel",
        "scientific": "Scomber scombrus",
        "type": "fresh",
        "color": "#5E718E",
        "emoji_id": "1206709905961132094",
        "rarity": 1,
        "price": 8,
        "min_size": 15,
        "max_size": 45,
        "description": "Mackerel is a fast-swimming, iridescent fish known for its slim, streamlined shape and rich, oily flesh, which is highly prized in various cuisines worldwide. These pelagic fish are found in both temperate and tropical seas, often forming large, shimmering schools near the surface. Mackerel are not only important for their culinary value but also play a crucial role in marine ecosystems as prey for larger predators such as sharks, dolphins, and tuna. Additionally, mackerel are a sustainable seafood choice due to their rapid reproduction rates and the efficient management of their fisheries in many regions, making them a favorite among environmentally conscious consumers."
    },
    "smelt": {
        "name": "Pond Smelt",
        "scientific": "Hypomesus olidus",
        "type": "fresh",
        "color": "#855F39",
        "emoji_id": "1206710694569836614",
        "rarity": 1,
        "price": 5,
        "min_size": 12,
        "max_size": 20,
        "description": "Blather: Pond smelt are small but vigorous fish that can survive in water of relatively poor quality. Pond smelt are related to salmon and as such have a lot of the same migratory tendencies. Most of them swim from rivers to the ocean and then return to rivers and lakes. However, some of them actually live in lakes that have no connection to the ocean, so they don't migrate. They have small fins and are perfect for eating whole as tempura or grilled on barbecues."
    },
    "sweetfish": {
        "name": "Sweetfish",
        "scientific": "Plecoglossus altivelis",
        "type": "fresh",
        "color": "#ADB834",
        "emoji_id": "1206711341935759441",
        "rarity": 1,
        "price": 10,
        "min_size": 20,
        "max_size": 40,
        "description": "Blather: Sweetfish are migratory fish born upstream that travel to the sea and then return to rivers to spawn. This migratory mind-set is what emphasizes their similarity to salmon. Adult sweetfish have a watermelon-like mossy smell when caught, since they eat moss on riverbed rocks. Sweetfish are very territorial and will attack rivals that encroach on their territory. Anglers use this combative nature against them by using lures made of other sweetfish."
    },
    "grass_carp": {
        "name": "Grass Carp",
        "scientific": "Ctenopharyngodon idella",
        "type": "fresh",
        "color": "#477238",
        "emoji_id": "1206712132893409320",
        "rarity": 1,
        "price": 15,
        "min_size": 45,
        "max_size": 130,
        "description": "Grass carp, a species of freshwater fish native to rivers and lakes in eastern Asia, is distinguished by its large size, elongated body, and silvery to olive-green coloring. Known scientifically as Ctenopharyngodon idella, this fish has been widely introduced globally for aquatic weed control, thanks to its voracious appetite for aquatic plants. While effective at managing vegetation in waterways, its introduction has sometimes led to ecological challenges, including the displacement of native species and alteration of habitats. Grass carp can grow remarkably large, reaching lengths of up to four feet or more, and are capable of living for several decades. In some regions, they are also farmed for food, providing a significant source of protein. Their adaptability to different environments, coupled with their utility in controlling aquatic plants, makes grass carp a notable species in both aquaculture and environmental management contexts."
    },
    "false_gudgeon": {
        "name": "False Gudgeon",
        "scientific": "Abbottina rivularis",
        "type": "fresh",
        "color": "#B47537",
        "emoji_id": "1206713082060087387",
        "rarity": 1,
        "price": 10,
        "min_size": 4,
        "max_size": 15,
        "description": "False Gudgeons are benthic fish, meaning they spend most of their time near the bottom of water bodies, where they feed on small invertebrates and detritus. Despite their small size, they play an important role in their ecosystems as both prey for larger fish and as predators of smaller aquatic organisms. One of the notable features of the False Gudgeon is its resilience and adaptability to different environmental conditions, which allows it to inhabit a range of freshwater ecosystems, from clear streams and rivers to turbid, stagnant waters. They are not widely known outside of enthusiast circles, but within their range, they are appreciated for their ecological role and the complexity they add to the biodiversity of freshwater systems."
    },
    "flounder": {
        "name": "Flounder",
        "scientific": "Paralichthys dentatus",
        "type": "salt",
        "color": "#7F8E44",
        "emoji_id": "1205856191477981234",
        "rarity": 2,
        "price": 65,
        "min_size": 20,
        "max_size": 60,
        "description": "Blather: Flounders are rather flexible whitefish that have both eyes on the left side of their body. They can reach three feet in length and are commonly mistaken for dabs, a close relative. When young, they have an eye on each side, but as they age, their right eye migrates to their left side. These carnivorous fish can change color to camouflage themselves on the seabed as they wait for prey."
    },
    "crab": {
        "name": "Crab",
        "scientific": "Brachyura",
        "type": "salt",
        "color": "#807B7A",
        "emoji_id": "1205857671350190092",
        "rarity": 2,
        "price": 50,
        "min_size": 8,
        "max_size": 30,
        "description": "Crabs are an infraorder of crustaceans encompassing over 7000 species found all throughout the world. Most are aquatic, with species of this type being found in both freshwater and saltwater environments (including all five oceans), but some variants predominantly reside on land. True crabs are primarily distinguished by the near total absence of a visible tail, resulting in a distinctly oblong shape. Crabs are omnivorous, and depending on their environment and current circumstances may primarily eat plant matter, prey on living animals, or scavenge corpses."
    },
    "angel_fish": {
        "name": "Angel Fish",
        "scientific": "Pterophyllum",
        "type": "fresh",
        "color": "#FFF089",
        "emoji_id": "1206299682800795658",
        "rarity": 2,
        "price": 45,
        "min_size": 4,
        "max_size": 14,
        "description": "Blather: The angelfish is a small, beautifully colored tropical fish known for its elegant, triangular fins, reminiscent of the wings of an angel, hence the name. These creatures inhabit freshwater rivers and are quite popular in aquariums. Despite their serene appearance, angelfish are known to be somewhat... territorial, particularly during breeding season. They are carnivorous by nature, feeding on smaller fish and invertebrates. Still, one can't help but admire their graceful beauty, even if one is more inclined towards fossils and the like."
    },
    "cherry_salmon": {
        "name": "Cherry Salmon",
        "scientific": "Oncorhynchus masou",
        "type": "fresh",
        "color": "#855F39",
        "emoji_id": "1206305328803614763",
        "rarity": 2,
        "price": 55,
        "min_size": 30,
        "max_size": 70,
        "description": "Blather: The spotted pattern on cherry salmon serves as a camouflage and is rather common in all salmon. Most cherry salmon spend their lives in rivers, but some do migrate to the ocean to fully mature. They are popular with anglers because of their well-balanced physique and beautiful patterns. Plus, their nervous nature makes them a good challenge to catch, which just adds to the fun."
    },
    "nibble_fish": {
        "name": "Nibble Fish",
        "scientific": "Garra rufa",
        "type": "fresh",
        "color": "#4C3D2F",
        "emoji_id": "1206308667989696532",
        "rarity": 2,
        "price": 40,
        "min_size": 5,
        "max_size": 10,
        "description": "Blather: The official name given to this warm-water-dwelling species of fish is 'Garra rufa'. They are omnivorous, as they both eat algae and scrape the skin off other fish. All you'd have to do to feed them is stick your hand in the tank; they would live off your dead skin. That's why they're called nibble fish. They exfoliate but don't have any teeth, so it doesn't hurt at all!"
    },
    "rainbow_trout": {
        "name": "Rainbow Trout",
        "scientific": "Oncorhynchus mykiss",
        "type": "fresh",
        "color": "#C6B858",
        "emoji_id": "1206311688773701702",
        "rarity": 2,
        "price": 50,
        "min_size": 40,
        "max_size": 75,
        "description": "Blather: When rainbow trout get bigger, they develop a pretty pink band from their gills to their tails. Some of them spend their entire lives in rivers, while others live in the ocean. Steelhead trout are a unique type of rainbow trout that live in the ocean and return to freshwater to spawn. Rainbow trout are a major species of fish, but finding them in the wild is actually fairly rare."
    },
    "sea_cucumber": {
        "name": "Sea Cucumber",
        "scientific": "Holothuroidea",
        "type": "salt",
        "color": "#9052BC",
        "emoji_id": "1206312477227360328",
        "rarity": 2,
        "price": 45,
        "min_size": 3,
        "max_size": 50,
        "description": "Blather: Sea cucumbers are similar to sea urchins and sea stars but are far more slender and softer. When threatened by a predator, they expel part of their internal organs as a natural defense. This is to blind and entangle the enemy so the sea cucumber has a window of escape. Some types of sea cucumbers allow predators to feed on their internal organs while they escape. Don't shed a tear for them, though as the internal organs grow back after a while."
    },
    "shrimp": {
        "name": "Shrimp",
        "scientific": "Caridea",
        "type": "salt",
        "color": "#F1641E",
        "emoji_id": "1206313368810684416",
        "rarity": 2,
        "price": 40,
        "min_size": 3,
        "max_size": 8,
        "description": "Shrimp are small, decapod crustaceans found in a wide range of aquatic environments, from freshwaters to the deepest parts of the ocean. Characterized by their elongated bodies and a flexible exoskeleton, shrimp are known for their ability to swim backward rapidly, thanks to a powerful flick of their abdomen and tail. They come in various sizes and colors, depending on the species, which number in the thousands."
    },
    "starfish": {
        "name": "Starfish",
        "scientific": "Asteroidea",
        "type": "salt",
        "color": "#FCA570",
        "emoji_id": "1206313924509704263",
        "rarity": 2,
        "price": 50,
        "min_size": 10,
        "max_size": 30,
        "description": "Blather: These star-shaped creatures have hundreds of tiny feet attached to their mobile arms. This allows them to slowly walk and open shellfish for food, making them effective predators. If an arm gets caught and ripped off by another predator, the sea star's arm will just grow back. Some sea stars eat by extending their stomachs out of their mouths to trap and then digest prey."
    },
    "walleye": {
        "name": "Walleye",
        "scientific": "Sander vitreus",
        "type": "fresh",
        "color": "#939446",
        "emoji_id": "1206314604326559774",
        "rarity": 2,
        "price": 65,
        "min_size": 50,
        "max_size": 90,
        "description": "The walleye is a freshwater fish native to Northern and Central United States and Canada, highly regarded by anglers for its taste and sporting qualities. Recognizable by its olive and gold coloring, the walleye has distinctive, glassy eyes that reflect light, an adaptation for its preference for low-light conditions or murky waters. This feature is also the origin of its name, as it allows the fish to see well in dark environments, aiding in its hunting of smaller fish."
    },
    "clownfish": {
        "name": "Clownfish",
        "scientific": "Amphiprioninae",
        "type": "salt",
        "color": "#F1641E",
        "emoji_id": "1206323018427666513",
        "rarity": 2,
        "price": 60,
        "min_size": 5,
        "max_size": 12,
        "description": "Blather: Clown fish spend their lives hiding among the feelers of sea anemones, a place only they can live. Their homes may be dangerous, but they produce a special coating that protects them from the poison. In exchange for the anemone's protection, the clown fish chases off any parasitic bugs and enemies. Curiously, all clown fish are males when they're young but change into females if necessity demands."
    },
    "loach": {
        "name": "Loach",
        "scientific": "Misgurnus anguillicaudatus",
        "type": "fresh",
        "color": "#586334",
        "emoji_id": "1206323648995262547",
        "rarity": 2,
        "price": 40,
        "min_size": 10,
        "max_size": 20,
        "description": "Blather: Loaches are rather small fish that make their habitats in rivers and muddy water. They have 10 whiskers around their mouths with taste buds built in for tasting sweetness and bitterness. Loaches can breathe through their intestines as well as their gills―a rather unique quality of the species. They push their mouths above the surface of the water to inhale, exhaling through their tail regions. Making stew with loaches and burdock root is known to improve stamina, or so people believe."
    },
    "coral": {
        "name": "Coral",
        "scientific": "Anthozoa",
        "type": "salt",
        "color": "#F6A2A7",
        "emoji_id": "1206326048875356160",
        "rarity": 2,
        "price": 50,
        "min_size": 5,
        "max_size": 50,
        "description": "A coral is not just a single organism, but a fascinating, complex community composed of thousands of tiny animals called polyps. These polyps live together in colonies, creating the vibrant, diverse structures we recognize as coral reefs. Coral polyps have a symbiotic relationship with algae called zooxanthellae, which live inside their tissues. The coral provides a protected environment and compounds necessary for photosynthesis, while the algae supply oxygen and remove waste. This partnership allows corals to thrive in nutrient-poor tropical waters, creating some of the most biodiverse ecosystems on Earth."
    },
    "lobster": {
        "name": "Lobster",
        "scientific": "Nephropidae",
        "type": "salt",
        "color": "#B9451D",
        "emoji_id": "1206327018996895785",
        "rarity": 2,
        "price": 60,
        "min_size": 20,
        "max_size": 50,
        "description": "Blather: Lobsters live in the ocean, have large, powerful claws, and are closely related to crawfish. They are a delicacy, also known by the names 'crawfish of the sea' or 'homard', their French name. However, unlike crawfish, they are much bigger and can live for more than a hundred years. Lobsters are aggressive and will pinch with their claws if you don't properly bind them while handling."
    },
    "neon_tetra": {
        "name": "Neon Tetra",
        "scientific": "Paracheirodon innesi",
        "type": "fresh",
        "color": "#42BFE8",
        "emoji_id": "1206713615877545994",
        "rarity": 2,
        "price": 60,
        "min_size": 3,
        "max_size": 7,
        "description": "Blather: Neon tetras get their name from the beautiful blue metallic line on their bodies. Although they're shy, gentle fish, surprisingly they're related to the piranha, though very distantly. They have very sharp and narrow teeth, an odd contrast to their beauty. They are delicate fish who tend to be very sensitive to the cleanliness and temperature of water."
    },
    "sea_horse": {
        "name": "Sea Horse",
        "scientific": "Hippocampus",
        "type": "salt",
        "color": "#F8C53A",
        "emoji_id": "1206327858834837545",
        "rarity": 2,
        "price": 45,
        "min_size": 3,
        "max_size": 30,
        "description": "Blather: Sea horses don't look like fish, but they still share a lost of distinct connections. They use their small dorsal fins and tail fins to swim, but in actuality they're pretty bad swimmers. They wrap their tail fins around seaweed or coral so they won't float away with the current. Once attached, they feed on plankton and small shrimp that float by. The female deposits eggs in the male's pouch, putting the burden of child care on the male."
    },
    "darksleeper": {
        "name": "Darksleeper",
        "scientific": "Odontobutis obscura",
        "type": "fresh",
        "color": "#D39741",
        "emoji_id": "1206714757890187274",
        "rarity": 2,
        "price": 40,
        "min_size": 6,
        "max_size": 10,
        "description": "The Darksleeper is a fascinating freshwater fish with a knack for playing hide and seek. True to its name, it has a secretive nature, often burying itself in the sand or mud at the bottom of rivers, streams, and lakes to ambush unsuspecting prey. Its camouflage game is strong, blending seamlessly with its surroundings to catch small fish, insects, and other aquatic critters. What sets the Darksleeper apart is its ability to survive in low-oxygen environments, thanks to some clever biological tricks. It can gulp air from the surface, allowing it to live in waters that would suffocate other fish. This sneaky swimmer isn't just a survival expert; it's also a bit of a night owl, preferring to hunt and move around under the cover of darkness."
    },
    "bichir": {
        "name": "Saddled Bichir",
        "scientific": "Polypterus endlicheri endlicheri",
        "type": "fresh",
        "color": "#855F39",
        "emoji_id": "1206715569471098920",
        "rarity": 2,
        "price": 55,
        "min_size": 20,
        "max_size": 60,
        "description": "Blather: The cool-looking saddled bichir are ancient fish with spiky fins on their backs. Though they've been around for more than 400 million years, they remain relatively unchanged. They have big appetites and will wait to ambush any fish they think will fit in their mouths. They can grow up to 30 inches (76 centimeters) long, making them rather large fish indeed. They swim slowly in a way that gives them the appearance of walking like dinosaurs."
    },
    "crucian_carp": {
        "name": "Crucian Carp",
        "scientific": "Carassius carassius",
        "type": "fresh",
        "color": "#333C24",
        "emoji_id": "1206716547335200768",
        "rarity": 2,
        "price": 40,
        "min_size": 10,
        "max_size": 20,
        "description": "Blather: Crucian carp are fairly easy fish for beginners to catch, but they're also popular with veteran anglers. They are related to koi and can live up to 15 years, making them a great fish to keep in a pond. Male offspring are seldom born, so females significantly outnumber males, making populations suffer. Luckily, females can reproduce with males of some other species, so the problem is relatively temporary."
    },
    "goby": {
        "name": "Goby",
        "scientific": "Gobiidae",
        "type": "fresh",
        "color": "#886E6A",
        "emoji_id": "1206717099544805427",
        "rarity": 2,
        "price": 45,
        "min_size": 8,
        "max_size": 40,
        "description": "Blather: These short and stocky river-dwelling fish have a lot of slender teeth for tearing apart other fish. Freshwater gobies dig holes under rocks in riverbeds to make nests for eggs, which the males guard. Other fish breeds take advantage of this protective quality and often lay eggs in goby nests."
    },
    "tuna": {
        "name": "Tuna",
        "scientific": "Thunnus",
        "type": "salt",
        "color": "#465456",
        "emoji_id": "1205859168452349962",
        "rarity": 3,
        "price": 250,
        "min_size": 50,
        "max_size": 300,
        "description": "Blather: Tuna can reach almost 10 feet (3 meters) in length and weigh over 800 pounds (360 kg), which is huge in the fish world. Combining this great size with their good flavor makes them literally the biggest catch for most anglers. Tuna can't breathe when they aren't moving, so their entire lives revolve around constantly swimming. To sleep, they merely slow down. This ability to swim while sleeping is a huge advantage. They're also rather fast, capable of beating both sets of fins so hard they reach speeds of 50 mph (80 km/h)."
    },
    "char": {
        "name": "Char",
        "scientific": "Salvelinus",
        "type": "fresh",
        "color": "#F8C53A",
        "emoji_id": "1206304229799755856",
        "rarity": 3,
        "price": 225,
        "min_size": 15,
        "max_size": 50,
        "description": "Blather: Char are related to salmon and live in rivers upstream, not generally migrating to the ocean. They prefer colder water and dwell in secluded, clear rivers deep in mountain ranges. Since they tend to hid mostly in between rocks in these cold areas, they can be rather difficult to spot."
    },
    "pomfret": {
        "name": "Pomfret",
        "scientific": "Bramidae",
        "type": "salt",
        "color": "#B8CCD8",
        "emoji_id": "1206309900117086259",
        "rarity": 3,
        "price": 300,
        "min_size": 60,
        "max_size": 120,
        "description": "The pomfret is a type of marine fish that is highly valued for its delicate flavor and firm, white flesh, making it a popular choice in various culinary traditions around the world. These fish are characterized by their flat bodies and deeply forked tails, with a shape somewhat resembling a fan, which allows them to navigate adeptly through their aquatic habitats. Pomfrets are found in warmer waters and are commonly harvested in the Atlantic, Pacific, and Indian Oceans."
    },
    "pompano": {
        "name": "Pompano",
        "scientific": "Sander vitreus",
        "type": "salt",
        "color": "#EFDD91",
        "emoji_id": "1206315522019303514",
        "rarity": 3,
        "price": 285,
        "min_size": 20,
        "max_size": 45,
        "description": "The pompano is a highly valued marine fish known for its rich flavor, firm texture, and high fat content, making it a favorite among chefs and food enthusiasts. Belonging to the family Carangidae, the pompano is often found in warm coastal waters, including the Atlantic coast of North America and the Gulf of Mexico. These fish prefer shallow, sandy, or muddy bottoms where they feed on a diet of invertebrates, small fish, and crustaceans."
    },
    "ray": {
        "name": "Ray",
        "scientific": "Batoidea",
        "type": "salt",
        "color": "#855F39",
        "emoji_id": "1206318424154710066",
        "rarity": 3,
        "price": 260,
        "min_size": 20,
        "max_size": 80,
        "description": "Blather: Beating their large fins up and down to move through the water almost gives rays the impression of flying. If viewed from below, rays appear to have their mouths curled up into a sort of smile. Some varieties have poisonous spikes at the base of their long tail fins that can be fatal to humans. This, combined with the ability to hide in sand at the bottom of the sea, can make them very dangerous."
    },
    "koi": {
        "name": "Koi",
        "scientific": "Cyprinus rubrofuscus",
        "type": "fresh",
        "color": "#F1641E",
        "emoji_id": "1206319287254384741",
        "rarity": 3,
        "price": 300,
        "min_size": 10,
        "max_size": 30,
        "description": "Blather: Though typically pale in color, these aquarium fish also can be found with rather beautiful patterns. This is all thanks to very selective breeding of carp with genetic mutations, allowing for diversity. No two koi have the exact same pattern and are popularly known as 'swimming jewels' as a result. They can be sold for a very high price, depending on their coloring and pattern. If properly cared for, they can live for over 100 years, making them a staple for outdoor garden ponds."
    },
    "eel": {
        "name": "Eel",
        "scientific": "Anguilliformes",
        "type": "fresh",
        "color": "#807B7A",
        "emoji_id": "1206329184738082836",
        "rarity": 3,
        "price": 240,
        "min_size": 5,
        "max_size": 200,
        "description": "Blather: Eels are born in the ocean but swim upstream through rivers when they become adults. They do, however, eventually swim back to the ocean when it is time to lay eggs. Their blood can be toxic, which is why you've never heard of eel sashimi. It's just too dangerous. Cooked eel, however, is edible and has no poisonous effects to speak of, making it a popular dish. For a long time, the egg-laying locations and habits of eels were largely a mystery. However, they are gradually being revealed through research, making eels a very hot topic of study."
    },
    "jellyfish": {
        "name": "Jellyfish",
        "scientific": "Scyphozoa",
        "type": "salt",
        "color": "#E27285",
        "emoji_id": "1206329822628945930",
        "rarity": 3,
        "price": 260,
        "min_size": 20,
        "max_size": 210,
        "description": "Blather: Jellyfish and other gelatinous creatures are some of the ocean's most beautiful animal life. Some of them do pack a painful sting, but you'll be fine if you observe them from a respectful distance."
    },
    "puffer_fish": {
        "name": "Puffer Fish",
        "scientific": "Tetraodontidae",
        "type": "salt",
        "color": "#D6A851",
        "emoji_id": "1206330599564906546",
        "rarity": 3,
        "price": 230,
        "min_size": 10,
        "max_size": 50,
        "description": "Blather: As expected, all Puffer Fish are covered in spines. While related to the blowfish, they are not poisonous. Exaggerated claims about the fish say they have 1,000 spines; the true number is between 300 and 400. When threatened, they suck in water and air to puff themselves up in order to intimidate enemies."
    },
    "piranha": {
        "name": "Piranha",
        "scientific": "Pygocentrus nattereri",
        "type": "fresh",
        "color": "#855F39",
        "emoji_id": "1206331243147296768",
        "rarity": 3,
        "price": 215,
        "min_size": 15,
        "max_size": 40,
        "description": "Blather: They have terrifyingly sharp teeth, which contributes to their ferocious reputation. Oddly enough, they are actually quite timid, though they are still very dangerous fish. If they can't find food, they will resort to cannibalism or tear apart any animal they can grab hold of. Take care when catching them so they don't end up biting your hand with their sharp teeth!"
    },
    "turtle": {
        "name": "Sea Turtle",
        "scientific": "Chelonioidea",
        "type": "salt",
        "color": "#586334",
        "emoji_id": "1206717552412328056",
        "rarity": 3,
        "price": 400,
        "min_size": 70,
        "max_size": 200,
        "description": "Sea turtles are ocean-dwelling creatures that have captured human fascination for centuries. These ancient reptiles, which have been around for over 100 million years, are remarkable for their long migrations across oceans, some traveling thousands of miles to return to the beaches where they were born to lay their own eggs. They are known for their longevity, with some species living up to 50 years or more. (Also theyre my favorite animal)"
    },
    "red_snapper": {
        "name": "Red Snapper",
        "scientific": "Lutjanus campechanus",
        "type": "salt",
        "color": "#F1641E",
        "emoji_id": "1206718314576089149",
        "rarity": 3,
        "price": 275,
        "min_size": 50,
        "max_size": 100,
        "description": "Blather: Red snappers are gregarious fish that often form schools close to reefs and shipwrecks. They are a prized food fish, but because of demand, other species are often served as 'red snapper'. They usually live up to 50 years. The oldest recorded red snapper was thought to be 57."
    },
    "barracuda": {
        "name": "Barracuda",
        "scientific": "Sphyraena",
        "type": "salt",
        "color": "#5E718E",
        "emoji_id": "1208420301336084510",
        "rarity": 3,
        "price": 280,
        "min_size": 60,
        "max_size": 150,
        "description": "The barracuda is a fascinating marine creature known for its fearsome appearance and remarkable hunting skills. Belonging to the genus Sphyraena, the barracuda is easily recognizable by its elongated body, sharp, pointed head, and large mouth filled with razor-sharp teeth. These fish can grow to be quite large, with some species reaching up to 6 feet in length. Barracudas are primarily found in the warmer waters of the world's oceans, where they lurk in shallow waters waiting to ambush their prey. They rely on their incredible speed and burst of acceleration to catch other fish, squid, and even small sharks. Their silver scales and sleek body allow them to blend into the surrounding water, making it difficult for both prey and predators to spot them. Despite their fearsome reputation, barracudas are not generally considered dangerous to humans unless provoked. They are a popular subject of marine photography and an exciting challenge for sport fishermen, contributing to the mystique and allure that surrounds these powerful predators of the sea."
    },
    "cuban_gar": {
        "name": "Cuban Gar",
        "scientific": "Atractosteus tristoechus",
        "type": "salt",
        "color": "#DDCEBF",
        "emoji_id": "1208421946438451210",
        "rarity": 3,
        "price": 310,
        "min_size": 50,
        "max_size": 200,
        "description": "Blather: Their long faces and large mouths make them look like alligators. Some can grow up to three yards. They are ancient fish that haven't changed since they first appeared millions of years ago. They breathe not only through gills, but also by sticking their mouths above the surface of the water. Gar eggs are poisonous, so people all over the world are advised to not eat them--no exceptions."
    },
    "squid": {
        "name": "Squid",
        "scientific": "Teuthida",
        "type": "salt",
        "color": "#BDA499",
        "emoji_id": "1208422500174667916",
        "rarity": 3,
        "price": 260,
        "min_size": 15,
        "max_size": 60,
        "description": "Blather: People assume squids have legs, but those are actually arms. There are 10 in all; two are used to grab prey. To swim, they twist their fins and expel water from inside their bodies to allow for fluid motion. The ink they shoot when threatened forms into the shape of a squid, acting as a sort of body double."
    },
    "mantis_shrimp": {
        "name": "Mantis Shrimp",
        "scientific": "Stomatopoda",
        "type": "salt",
        "color": "#C68556",
        "emoji_id": "1208423448712314890",
        "rarity": 3,
        "price": 315,
        "min_size": 5,
        "max_size": 18,
        "description": "Blather: Mantis shrimps have long, sickle-shaped legs and thick carapaces covering both their bodies and tails. They strike captured prey with claws powerful enough to crack the shells of even the toughest crabs. They are a popular dish with fans of seafood, though females with eggs are worth more than males."
    },
    "octopus": {
        "name": "Octopus",
        "scientific": "Octopus Vulgaris",
        "type": "salt",
        "color": "#F6A2A7",
        "emoji_id": "1208424094530281472",
        "rarity": 3,
        "price": 345,
        "min_size": 20,
        "max_size": 100,
        "description": "Blather: Many people think octopuses have eight legs, but those are not legs. Their tentacles are actually arms. They have a strange anatomy, with their head located between their body and arms. The flexible arms are perfect for catching all kinds of crab, shrimp, and shellfish, especially in reefs. When attacked by predators, octopuses emit a black ink that spreads through the water. This greatly reduces visibility and allows them to escape, making them highly skilled at disappearing."
    },
    "monkfish": {
        "name": "Monkfish",
        "scientific": "Lophius",
        "type": "salt",
        "color": "#BDA499",
        "emoji_id": "1208425461734965318",
        "rarity": 3,
        "price": 360,
        "min_size": 70,
        "max_size": 150,
        "description": "The monkfish, also known as the anglerfish, is a distinctive and somewhat bizarre-looking sea creature found in the Atlantic and Mediterranean waters. Notorious for its wide, gaping mouth and sharp teeth, the monkfish has a unique method of hunting: it uses a fleshy growth (esca) on its head as a lure to attract prey. This adaptation allows the monkfish to remain mostly stationary on the sea floor, waiting for unsuspecting fish to come close enough to be engulfed in one swift motion. Despite its unappealing appearance, the monkfish is highly prized for its tail meat, often referred to as 'poor man's lobster' due to its sweet, firm texture. This culinary delight contrasts sharply with the monkfish's menacing look, making it a fascinating subject of both marine biology and gastronomy."
    },
    "striped_beakfish": {
        "name": "Striped Beakfish",
        "scientific": "Oplegnathus fasciatus",
        "type": "salt",
        "color": "#595757",
        "emoji_id": "1208426288717758484",
        "rarity": 3,
        "price": 290,
        "min_size": 10,
        "max_size": 80,
        "description": "Blather: Striped beakfish stand out thanks to the seven stripes adorning their white bodies. Their natural curiosity and strong pull make them a popular target of anglers, but they're no easy catch. They have strong teeth that allow them to make short work of sea creatures with tough shells. This means that both urchins and mollusks need to be careful, lest they become meals for these fish."
    },
    "crayfish": {
        "name": "Crayfish",
        "scientific": "Palinuridae",
        "type": "fresh",
        "color": "#B4202A",
        "emoji_id": "1208427661387636817",
        "rarity": 3,
        "price": 270,
        "min_size": 4,
        "max_size": 12,
        "description": "Blather: These shrimp relatives are usually found in ponds and rivers, typically making them easy to catch. The reason for this strange habitat is that crawfish are plentiful and will eat just about anything. Eating plant material makes their bodies red, but only eating fish and meat will turn their bodies blue. A red color indicates they are eating a healthy and balanced diet, so red is the ideal for the species."
    },
    "oarfish": {
        "name": "Oarfish",
        "scientific": "Regalecus glesne",
        "type": "salt",
        "color": "#B4202A",
        "emoji_id": "1205860990403608696",
        "rarity": 4,
        "price": 1500,
        "min_size": 200,
        "max_size": 800,
        "description": "Blather: The oarfish is a long, eel-like fish that can supposedly reach up to 36 feet in length. They appear in various legends as things like messengers of the gods. It seems to me a creature like that could explain the myth of massive, ship-crushing sea serpents. It is, of course, well documented that people tend to exaggerate the size of 'the one that got away'."
    },
    "dorado": {
        "name": "Dorado",
        "scientific": "Salminus brasiliensis",
        "type": "fresh",
        "color": "#D39741",
        "emoji_id": "1206306346631299112",
        "rarity": 4,
        "price": 1300,
        "min_size": 30,
        "max_size": 130,
        "description": "Blather: Dorado means 'golden' in Spanish. As the name would indicate, these fish are gold and have black dots. They look like salmon but are very toothy, carnivorous, and related to piranha. They're such ferocious fish that other fish regularly flee from them, fearful of becoming a snack. Their ferocious nature and power make them a prize catch among anglers."
    },
    "golden_trout": {
        "name": "Golden Trout",
        "scientific": "Oncorhynchus aguabonita",
        "type": "fresh",
        "color": "#F8C53A",
        "emoji_id": "1206320062915416214",
        "rarity": 4,
        "price": 1500,
        "min_size": 15,
        "max_size": 25,
        "description": "Blather: The golden trout is a beautifully colored fish that can only live in very clean waters. They are difficult to come across since they are found only in high mountain streams. As a side note, I find it much easier to appreciate fish that aren't such prima donnas about everything."
    },
    "barelleye": {
        "name": "Barreleye",
        "scientific": "Macropinna microstoma",
        "type": "abyss",
        "color": "#3D6F43",
        "emoji_id": "1206332090833182812",
        "rarity": 4,
        "price": 2500,
        "min_size": 5,
        "max_size": 15,
        "description": "Blather: The barreleye is a deep-sea fish with protuberant eyes and a clear head, so some of its organs are... visible. At first blush, a transparent head seems absurd, but there is a reason: so it can see things directly above! But I must confess - the more I learn about deep-sea fish, the happier I am to live on dry land."
    },
    "football_fish": {
        "name": "Football Fish",
        "scientific": "Himantolophidae",
        "type": "abyss",
        "color": "#464762",
        "emoji_id": "1206333028851392603",
        "rarity": 4,
        "price": 2000,
        "min_size": 5,
        "max_size": 60,
        "description": "Blather: Football fish live in parts of the ocean so deep that light does not reach them. Their lanterns, which they sway back and forth to lure prey, can emit light thanks to special bacteria. When prey gets near, they shoot a luminescent liquid and snatch the prey while it's blinded by the light. Only females possess the useful lantern. They can grow to be about two feet by maturity. Males are small, less than two inches in length."
    },
    "betta": {
        "name": "Betta",
        "scientific": "Betta splendens",
        "type": "fresh",
        "color": "#8BA1F6",
        "emoji_id": "1208428007270649956",
        "rarity": 4,
        "price": 1700,
        "min_size": 3,
        "max_size": 7,
        "description": "Blather: The betta has long fins and beautiful coloring. It is a tropical fish popular in decorative aquariums. They're very territorial and will fight to complete exhaustion, so aquarists must keep them carefully. Rarely do such beauty and violence commingle outside the rowdiest of sunset-viewing parties."
    },
    "moray_eel": {
        "name": "Moray Eel",
        "scientific": "Uropterygius xanthopterus",
        "type": "salt",
        "color": "#D6A851",
        "emoji_id": "1208428949882019960",
        "rarity": 4,
        "price": 1400,
        "min_size": 150,
        "max_size": 350,
        "description": "Blather: Moray eels can often be seen sticking just their heads out from between two rocks. When unsuspecting prey approaches, they dart out to snatch it up into their sharp-toothed mouths. Once moray eels have their teeth in you, it's hard to get away, making moray-eel bites no trifling matter. Their long, finless bodies are covered in tough, snakelike skin that often gets used as leather."
    },
    "whaleshark": {
        "name": "Whaleshark",
        "scientific": "Rhincodon typus",
        "type": "salt",
        "color": "#886E6A",
        "emoji_id": "1205861679443738735",
        "rarity": 5,
        "price": 13000,
        "min_size": 1200,
        "max_size": 2000,
        "description": "The whale shark holds many records for size in the animal kingdom, most notably being by far the most massive living non-mammalian animal. Whale sharks inhabit the open waters of all tropical oceans, so they are rarely found in water below 21 °C (70 °F). Their lifespans are estimated to be between 80 and 130 years. Whale sharks have very large mouths and are filter feeders, which is a feeding mode that occurs in only two other sharks, the megamouth shark and the basking shark. They feed almost exclusively on plankton and small fishes and pose no threat to humans."
    },
    "great_white_shark": {
        "name": "Great White Shark",
        "scientific": "Carcharodon carcharias",
        "type": "salt",
        "color": "#485263",
        "emoji_id": "1206320908516720751",
        "rarity": 5,
        "price": 11000,
        "min_size": 300,
        "max_size": 700,
        "description": "Blather: The triangular teeth of sharks appear to have evolved from scales sometime in the past. When a tooth breaks, it quickly falls out and a new one grows in, keeping them always in good shape for prey. Sharks can be fearsome creatures, able to smell blood from several miles away. They can even jump out of the water to catch prey, making them powerful predators. Contrary to their tough image, their bones are made of cartilage and erroneously used as health food."
    },
    "hammerhead_shark": {
        "name": "Hammerhead Shark",
        "scientific": "Sphyrnidae",
        "type": "salt",
        "color": "#695B59",
        "emoji_id": "1206321689751851049",
        "rarity": 5,
        "price": 10000,
        "min_size": 300,
        "max_size": 550,
        "description": "Blather: The hammerhead shark is a shark with a head like a hammer, which is what you'd expect. However, despite being sharks, they are actually fairly laid back, which is not what you'd expect. With their eyes positioned on the two ends of their 'hammer,' they can see in almost all directions. Oddly, their nose holes are located right next to their eyes on their hammer section. They have a number of small holes on the front and lower portions of their heads as well. These holes allow them to detect prey, even fish hiding below them and out of sight. While they eat a nice array of fish, it seems rays are their favorite source of food. Rays, beware!"
    }
}